from controllers import LibraryController
from models import Library
from os import system


def logo() -> None:
    """
    Выводит на экран логотип приложения.
    :return: None
    """
    system('cls')
    input(r"""  ||_______________________||__________________________|
  | _____________________  ||      __   __  _  __    _ |
  ||=|=|=|=|=|=|=|=|=|=|=| __..\/ |  |_|  ||#||==|  / /|
  || | | | | | | | | | | |/\ \  \\|  Добро пожаловать  |
  ||_|_|_|_|_|_|_|_|_|_|_/_/\_.___\  в мою библиотеку! |
  |____________________ /\~()/()~//\ __________________|
  | __   __    _  _     \_  (_ .  _/ _    ___     _____|
  ||~~|_|..|__| || |_ _   \ //\\ /  |=|__|~|~|___| | | |
  ||--|+|^^|==|1||2| | |__/\ __ /\__| |==|x|x|+|+|=|=|=|
  ||__|_|__|__|_||_|_| /  \ \  / /  \_|__|_|_|_|_|_|_|_|
  |_________________ _/    \/\/\/    \_ _______________|
  | _____   _   __  |/      \../      \|  __   __   ___|
  ||_____|_| |_|##|_||   |   \/ __|   ||_|==|_|++|_|-|||
  ||______||=|#|--| |\   \   o    /   /| |  |~|  | | |||
  ||______||_|_|__|_|_\   \  o   /   /_|_|__|_|__|_|_|||
  |_________ __________\___\____/___/___________ ______|
  |__    _  /    ________     ______           /| _ _ _|
  |\ \  |=|/   //    /| //   /  /  / |        / ||%|%|%|
  | \/\ |*/  .//____//.//   /__/__/ (_)      /  ||=|=|=|
__|  \/\|/   /(____|/ //                    /  /||~|~|~|__
  |___\_/   /________//   ________         /  / ||_|_|_|
  |___ /   (|________/   |\_______\       /  /| |______|
      /                  \|________)     /  / | |""")


def main_menu() -> str:
    """
    Выводит на экран главное меню и возвращает выбор пользователя.

    Returns:
        str: Введенное пользователем значение.
    """
    return input('''1. Добавить книгу
2. Удалить книгу
3. Поиск книги
4. Показать все книги
5. Изменить статус книги
6. Выход
   Выберите действие (1-6): ''')


def run() -> None:
    """
    Функция, реализующая логику меню.

    Returns:
        None
    """
    logo()
    library = Library()
    controller = LibraryController(library)
    while True:
        system('cls')
        choice = main_menu()
        if choice == '1':
            controller.add_book()
        elif choice == '2':
            controller.remove_book()
        elif choice == '3':
            controller.search_books()
        elif choice == '4':
            controller.display_books()
        elif choice == '5':
            controller.change_book_status()
        elif choice == '6':
            break
        else:
            print("Неверный выбор, попробуйте снова.")


if __name__ == "__main__":
    run()
